# YVector Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalHelix..::..YVector Property
CylindricalHelix Class See Also
---
The Y direction vector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ YVector { get; }
```

Visual Basic
---
```text
Public ReadOnly Property YVector As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ YVector {
	XYZ^ get ();
}
```

# See Also
CylindricalHelix Class
Autodesk.Revit.DB Namespace